laminar_sphere_final/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{
    sphere
    {
        type triSurfaceMesh;
        file "sphere.stl";
    }

    box0
    {
       type searchableBox;
       min (-0.75 -0.75 -0.75);
       max ( 0.75  0.75  0.75);
    }

    box1
    {
       type searchableBox;
       min (-1.5 -1.5 -1.5);
       max ( 2.0  1.5  1.5);
    }

    box2
    {
       type searchableBox;
       min (-2 -2 -2);
       max ( 4  2  2);
    }
};
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMeshControls
{
    maxLocalCells               800000;
    maxGlobalCells              1000000;
    minRefinementCells          10;
    maxLoadUnbalance            0.1;
    resolveFeatureAngle         10;
    nCellsBetweenLevels         3;
    allowFreeStandingZoneFaces  true;

    features
    (   
        { file "sphere.eMesh"; level 3; }
    );

    refinementSurfaces
    {
        sphere
        {
            level (3 5);
        }
    }

    refinementRegions
    {
        /*
        sphere.stl
        {
            mode distance;
            levels ((3 0.25));
        }
        */

        box0
        {
            mode inside;
            levels ((1e10 3));
        }

        box1
        {
            mode inside;
            levels ((1e10 2));
        }

        box2
        {
            mode inside;
            levels ((1e10 1));
        }
    }

    locationInMesh (1.0 0 0);  
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

snapControls
{
    nSmoothPatch                5;
    tolerance                   2.0;
    nSolveIter                  30;
    nRelaxIter                  5;
    nFeatureSnapIter            10;
    implicitFeatureSnap         false; 
    explicitFeatureSnap         true;
    multiRegionFeatureSnap      false;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

addLayersControls
{
    layers
    {
        sphere
        {
            nSurfaceLayers 15;
        } 
    }

    relativeSizes               true; 
    expansionRatio              1.2;
    finalLayerThickness         0.85;
    //firstLayerThickness       0.1;
    minThickness                0.015;

    nGrow                       0;

    featureAngle                120;
    slipFeatureAngle            30;

    nLayerIter                  50;
    nRelaxdIter                 20;
    nRelaxIter                  5;

    nSmoothSurfaceNormals       1;
    nSmoothNormals              3;
    nSmoothThickness            10;
    maxFaceThicknessRatio       0.5;
    maxThicknessToMedialRatio   0.3;

    minMedialAxisAngle          90;
    minMedianAxisAngle          90;
    nMedialAxisIter             10;

    nBufferCellsNoExtrude       0;
    additionalReporting         false;  
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

meshQualityControls
{
    maxNonOrtho                 65;
    maxBoundarySkewness         5;
    maxInternalSkewness         5;
    maxConcave                  80;
    minFlatness                 -1;
    minVol                      1e-13;
    minTetQuality               -1e30;   
    minArea                     -1;
    minTwist                    0.03;  
    minDeterminant              0.001;
    minFaceWeight               0.05; 
    minVolRatio                 0.01;
    minTriangleTwist            -1; 
    nSmoothScale                3;  
    errorReduction              0.75; 
}

/*writeFlags
(
//  scalarLevels
    layerSets
    layerFields
); */

mergeTolerance 1e-6;

// ************************************************************************* //
