laminar_sphere_final/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (0.001561 0 0);
pressure             0;
turbulentKE          0.00009357;
turbulentOmega       0.00973;

// ************************************************************************* //
